Q1.

In [1]:
import pandas as pd

In [2]:
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]

In [3]:
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

In [4]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [5]:
# Print the data present in the second row
second_row_data = df.iloc[1]
print(second_row_data)

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Q2. What is the difference between the functions loc and iloc in pandas.DataFrame?

ans-In pandas, both loc and iloc are used to access data within a DataFrame, but they have different methods of indexing and selecting data.

loc:
The loc indexer is label-based and is used for selecting rows and columns based on their labels (i.e., index labels and column names). You can use it to access data using explicit row and column labels.
Syntax: df.loc[row_label, column_label]

In [6]:
# Access data in the second row and 'course_name' column using labels
data = df.loc[1, 'course_name']

iloc:
The iloc indexer is integer-based and is used for selecting rows and columns based on their integer positions. It's similar to traditional Python indexing.
Syntax: df.iloc[row_index, column_index]

In [7]:
# Access data in the second row and first column using integer positions
data = df.iloc[1, 0]

In your provided code, the line df.iloc[1] is using the iloc indexer to access the data in the second row of the DataFrame, which returns a pandas Series containing the data in that row.

Q3.

In [8]:
# Original DataFrame
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2, 3, 6, 4]
df = pd.DataFrame(data={'course_name': course_name, 'duration': duration})

In [9]:
df

        course_name  duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [10]:
# Reindexing the DataFrame
reindex = [3, 0, 1, 2]
new_df = df.reindex(reindex)

In [11]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [12]:
# Accessing data using loc
loc_output = new_df.loc[2]
print("Using loc:")
print(loc_output)

Using loc:
course_name    Big Data
duration              6
Name: 2, dtype: object

In [13]:
# Accessing data using iloc
iloc_output = new_df.iloc[2]
print("\nUsing iloc:")
print(iloc_output)

Using iloc:
course_name    Machine Learning
duration                      3
Name: 1, dtype: object

Observations and Explanation:

new_df.loc[2]:

The loc indexer is label-based, so when you use new_df.loc[2], it is trying to access the row with the label/index 2. However, after reindexing, the labels have changed, and the row with the label 2 now corresponds to the third row in the original DataFrame. Therefore, new_df.loc[2] retrieves the data from the third row of the reindexed DataFrame.

new_df.iloc[2]:

The iloc indexer is integer-based, so when you use new_df.iloc[2], it is trying to access the row with the integer position 2. After reindexing, the row that was originally in the third position (Big Data, 6) now occupies the second position in the reindexed DataFrame. Therefore, new_df.iloc[2] retrieves the data from the second row of the reindexed DataFrame.

In both cases, there is a difference between the outputs due to the change in index labels and positions after reindexing. The loc indexer accesses rows based on their labels, while the iloc indexer accesses rows based on their integer positions.

Q4.

In [14]:
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]

In [15]:
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [16]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.764272  0.064174  0.282547  0.857104  0.750591  0.665608
2  0.753175  0.296324  0.325017  0.361027  0.768996  0.595597
3  0.705694  0.906267  0.295609  0.126661  0.630655  0.765493
4  0.783697  0.898128  0.461596  0.894207  0.049479  0.134003
5  0.837819  0.416261  0.598974  0.549227  0.126366  0.254611
6  0.052493  0.945610  0.016601  0.737909  0.512735  0.506036

In [17]:
df1.mean()

column_1    0.649525
column_2    0.587794
column_3    0.330057
column_4    0.587689
column_5    0.473137
column_6    0.486891
dtype: float64

In [18]:
df1.columns

Index(['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'], dtype='object')

In [19]:
df1.column_2.std()

0.37797399324347053

Q5.

In [25]:
df1.loc[2, 'column_2'] = 'string_data'

In [26]:
df1

   column_1     column_2  column_3  column_4  column_5  column_6
1  0.764272     0.064174  0.282547  0.857104  0.750591  0.665608
2  0.753175  string_data  0.325017  0.361027  0.768996  0.595597
3  0.705694     0.906267  0.295609  0.126661  0.630655  0.765493
4  0.783697     0.898128  0.461596  0.894207  0.049479  0.134003
5  0.837819     0.416261  0.598974  0.549227  0.126366  0.254611
6  0.052493      0.94561  0.016601  0.737909  0.512735  0.506036

In [27]:
df1.mean()

/tmp/ipykernel_3097/2053335143.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df1.mean()

column_1    0.649525
column_3    0.330057
column_4    0.587689
column_5    0.473137
column_6    0.486891
dtype: float64

Explanation:

In the code above, the second row of 'column_2' is replaced with the string value 'string_data' using 
df1.loc[2, 'column_2'] = 'string_data'.

When we try to calculate the mean of 'column_2' using column_2_mean = df1['column_2'].mean(), it throws an error because the string 'string_data' cannot be converted to a numeric value for calculating the mean.

The error message indicates that it "could not convert string to float," which is what happens when a non-numeric value is encountered in a calculation that requires numeric data.

In summary, attempting to calculate the mean of a column containing non-numeric values, like strings, will result in a conversion error.

Q6

In pandas, window functions (also known as rolling or moving functions) are used to perform calculations on a "window" of data points within a specified range. These functions are particularly useful for analyzing time-series data or other sequential data where you want to calculate metrics over a moving window of observations.

Window functions allow you to compute metrics like rolling averages, rolling sums, moving standard deviations, and more. They help you understand trends, patterns, and variations in your data over time or any sequential order.

There are several types of window functions available in pandas:

Rolling Functions: These functions operate on a rolling window of fixed size and calculate various metrics within that window. Common rolling functions include:
rolling().mean(): Calculate the rolling mean.
rolling().sum(): Calculate the rolling sum.
rolling().std(): Calculate the rolling standard deviation.
rolling().min(): Calculate the rolling minimum.
rolling().max(): Calculate the rolling maximum.

In [1]:
import pandas as pd

# Creating a DataFrame with time-series data
data = {'value': [10, 15, 20, 25, 30]}
df = pd.DataFrame(data)

In [2]:
df

   value
0     10
1     15
2     20
3     25
4     30

In [3]:
# Calculate the rolling mean with a window size of 2
rolling_mean = df['value'].rolling(window=2).mean()
print(rolling_mean)

0     NaN
1    12.5
2    17.5
3    22.5
4    27.5
Name: value, dtype: float64

Expanding Functions: These functions calculate cumulative metrics over a growing window from the beginning of the data. They provide a broader perspective on how the cumulative metric evolves as new data points are added.
expanding().mean(): Calculate the expanding mean.
expanding().sum(): Calculate the expanding sum.
expanding().std(): Calculate the expanding standard deviation.
expanding().min(): Calculate the expanding minimum.
expanding().max(): Calculate the expanding maximum.

In [4]:
# Creating a DataFrame with time-series data
data = {'value': [10, 15, 20, 25, 30]}
df = pd.DataFrame(data)

In [5]:
df

   value
0     10
1     15
2     20
3     25
4     30

In [6]:
# Calculate the expanding sum
expanding_sum = df['value'].expanding().sum()
print(expanding_sum)

0     10.0
1     25.0
2     45.0
3     70.0
4    100.0
Name: value, dtype: float64

Q7.

In [7]:
import datetime

In [8]:
# Get the current date
current_date = datetime.datetime.now()

In [10]:
# Extract the current month and year
current_month = current_date.month
current_year = current_date.year

In [11]:
print(f"Current month: {current_month}")
print(f"Current year: {current_year}")

Current month: 8
Current year: 2023